/*
Tekst zadatka 
https://arena.petlja.org/competition/os7-202223-kvalifikacije1n#tab_134844
(ima i dole u fajlu)
*/

#include <bits/stdc++.h>

using namespace std;

int main()
{
    int k1, k2; // kolona
    cin >> k1 >> k2;

    int r1, r2; // red = vrsta
    cin >> r1 >> r2;

    int a, b, c, d;
    cin >> a >> b >> c >> d;

    //  k1 k2   zbirovi u kolonama
    //  |  |
    //  v  v
    //  A  B <- r1  zbirovi u redovima
    //  C  D <- r2

    // ukoliko neki od a, b, c, d nije validna cifra (od 1 do 9) popunjavanje nije validno
    if(a<1 || a>9 || b<1 || b>9 || c<1 || c>9 || d<1 || d>9) {
        cout << "ne" << endl;
        return 0; // prekidamo program
    }
    
    // ukoliko neka vrsta (red) ili kolona imas dva ista broja... popunjavanje nije validno
    if(a==b || c==d || a==c || b==d) {
        cout << "ne" << endl;
        return 0;
    }

    // ukoliko neki od zbirova nije tacan - popunjavanje nije validno
    if(k1 != a+c || k2 != b+d || r1 != a+b || r2 != c+d) {
        cout << "ne" << endl;
        return 0;
    }

    // ako su svi brojevi i zbirovi dobri, onda je popunjavanje dobro!
    cout << "da" << endl;
    return 0;
}

/*
У игри Какуро потребно је уписати цифре од 1 до 9 у празна поља табеле у складу са унапред задатим збировима врста и колона, тако да се сваки збир добија сабирањем различитих цифара. Ми ћемо размотрити једноставну варијанту ове игре у којој се бројеви уписују у 4 поља, распоређених у две хоризонталне (водоравне) врсте и две вертикалне (усправне) колоне, тако да су унапред дати збирови сваке врсте и сваке колоне. Напиши програм који проверава да ли су цифре уписане у складу са правилима игре Какуро.

Улаз
    Прва линија стандардног улаза садржи два позитивна природна броја између 3 и 17 који представљају збирове у свакој од две колоне. Наредна линија садржи два позитивна природна броја између 3 и 17 који представљају збирове у свакој врсти. Након тога се уносе 4 броја (задата у две линије) који су уписани у поља.
Излаз
    На стандардни излаз исписати da ако је табела попуњена исправно тј. ne ако није.

Пример 1
    Улаз
        14 8
        16 6
        9 7
        5 1

    Излаз
        da

Пример 2
    Улаз
        11 9
        17 3
        9 8
        3 1

    Излаз
        ne

    Објашњење
        Збир елемената прве колоне није 11 већ 12, а збир елемената друге врсте није 3 већ 4.

Пример 3
    Улаз
        11 10
        17 4
        9 8
        2 2

    Излаз
        ne

    Објашњење
        Иако се сви збирови поклапају, у другој врсти је два пута употребљена цифра 2.

Пример 4
    Улаз
        16 6
        14 8
        10 4
        6 2

    Излаз
        ne

    Објашњење
        Иако се сви збирови поклапају, употребљена је вредност 10 која није цифра.
*/
